# Imorting pandas

In [66]:
import pandas as pd
import numpy as np

In [67]:
df = pd.read_csv("C:\\Users\\gayanp\\PythonTest\\datasources\\iris.csv")
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# Top values of the data set

In [11]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [12]:
df.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

# Bottom values of the data set

In [13]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [15]:
df.tail(3)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# Columns & indexes of the data set

In [19]:
df.columns # get the column headers

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [18]:
list(df.columns)  # get the column headers as a list

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [30]:
df.index  # get the index number element amount

RangeIndex(start=0, stop=150, step=1)

In [29]:
list(df.index)  # get the column headers as a list

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149]

# Shape of the data frame

In [21]:
df.shape # get the shape of the data frame

(150, 5)

# Data type of columns

In [22]:
type(df)

pandas.core.frame.DataFrame

In [70]:
df["Sepal.Length"].dtype

dtype('float64')

In [72]:
df["Species"].dtype  #Object data type ---> Categorical Data (Text Data/String Data)

dtype('O')

# Adding new columns

In [ ]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

In [ ]:
# gayan

# Accessing columns & elements

# Accessing columns

In [61]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [33]:
df["Col2"]

0    45
1    43
2    44
3    46
4    54
Name: Col2, dtype: int64

In [34]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [49]:
df["Col1"],["Col3"]  # getting two columns

(0    12
 1    22
 2    23
 3    34
 4    45
 Name: Col1, dtype: int64,
 ['Col3'])

In [48]:
df[["Col1","Col3"]] #Better to get them as a list

   Col1  Col3
0    12    56
1    22    43
2    23    46
3    34    67
4    45    65

# Adding New columns

In [62]:
df["Col4"]  # See there is no any column called col4

KeyError: 'Col4'

In [63]:
df["Col4"]=[10,20,30,40,50] #adding new column called Col4
df   # printing datain col4

   Col1  Col2  Col3  Col4
0    12    45    56    10
1    22    43    43    20
2    23    44    46    30
3    34    46    67    40
4    45    54    65    50

# Accessing elements

In [79]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [84]:
df.iloc[3,2]

67

In [85]:
df.iloc[1,1]  # Row 1 col1

43

In [86]:
df.iloc[0,2]  # Row 1 col1

56

In [78]:
df.iloc[1:3,1:]

    B   C
1  24  43
2  67  23

# Converting to arrays

In [24]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [17]:
df["Col2"].values # get a column value lis as an array

array([45, 43, 44, 46, 54], dtype=int64)

In [18]:
df["Col2"].values # get a column value lis as an array

array([45, 43, 44, 46, 54], dtype=int64)

# Basic column operations

In [8]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [25]:
df["Col3"]=df["Col1"]+df["Col2"] # adding two columns
df

   Col1  Col2  Col3
0    12    45    57
1    22    43    65
2    23    44    67
3    34    46    80
4    45    54    99

In [14]:
df["Col4"]=["A" if v>10 else "B" for v in df["Col3"]] # if condition with Column values
df

   Col1  Col2  Col3 Col4
0     0     1     1    B
1     2     3     5    B
2     4     5     9    B
3     6     7    13    A
4     8     9    17    A

In [26]:
df["Col5"]=df["Col1"]+df["Col1"]+df["Col3"] # adding two columns
df

   Col1  Col2  Col3  Col5
0    12    45    57    81
1    22    43    65   109
2    23    44    67   113
3    34    46    80   148
4    45    54    99   189

# Selecting rows that have certain values

# Boolean masking technique

In [51]:
df=pd.DataFrame({"Name":["A","B","C","D","E","F"],"Age":[23,33,21,35,23,34],"Result":["Pass","Fail","Pass","Pass","Fail","Fail"]})
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail
5    F   34   Fail

In [52]:
df[df["Result"]=="Pass"]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [53]:
df[df["Age"]>=30]

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

In [54]:
df[ (df["Result"]=="Pass") & (df["Age"]>=30)] # using Pandas boolean "and" operator

  Name  Age Result
3    D   35   Pass

In [55]:
df[ (df["Result"]=="Pass") | (df["Age"]>=30)] #using Pandas boolean "or" operator

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
5    F   34   Fail

In [56]:
df[~(df["Age"]>=30)] # Pandas boolean "not" operator

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
4    E   23   Fail

# Data summaries

In [57]:
data=np.random.random(20).reshape(5,4)
data

array([[0.73656725, 0.53195203, 0.4898192 , 0.06073394],
       [0.50407145, 0.07097106, 0.87145171, 0.73374967],
       [0.41586844, 0.49214301, 0.77837972, 0.20530714],
       [0.68063433, 0.66783397, 0.69101397, 0.56049887],
       [0.87001441, 0.78583466, 0.78904873, 0.17794885]])

In [58]:
df=pd.DataFrame(data,columns=["A","B","C","D"],index=["a","b","c","d","e"])
df

          A         B         C         D
a  0.736567  0.531952  0.489819  0.060734
b  0.504071  0.070971  0.871452  0.733750
c  0.415868  0.492143  0.778380  0.205307
d  0.680634  0.667834  0.691014  0.560499
e  0.870014  0.785835  0.789049  0.177949

# Summaries for each column

In [59]:
df.describe() # summery is done for numerical values

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.641431  0.509747  0.723943  0.347648
std    0.182061  0.271359  0.145653  0.285376
min    0.415868  0.070971  0.489819  0.060734
25%    0.504071  0.492143  0.691014  0.177949
50%    0.680634  0.531952  0.778380  0.205307
75%    0.736567  0.667834  0.789049  0.560499
max    0.870014  0.785835  0.871452  0.733750

# Summaries for each row

In [60]:
df.transpose().describe()

              a         b         c         d         e
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.454768  0.545061  0.472925  0.649995  0.655712
std    0.283936  0.350512  0.237028  0.060413  0.320881
min    0.060734  0.070971  0.205307  0.560499  0.177949
25%    0.382548  0.395796  0.363228  0.641000  0.633863
50%    0.510886  0.618911  0.454006  0.674234  0.787442
75%    0.583106  0.768175  0.563702  0.683229  0.809290
max    0.736567  0.871452  0.778380  0.691014  0.870014

# Categorical columns

In [42]:
df=pd.DataFrame({"A":[23,34,21,45,67],"B":[45,24,67,88,67],"C":[56,43,23,56,56]})
df

    A   B   C
0  23  45  56
1  34  24  43
2  21  67  23
3  45  88  56
4  67  67  56

In [46]:
df.describe() # summery

               A          B          C
count   5.000000   5.000000   5.000000
mean   38.000000  58.200000  46.800000
std    18.841444  24.427444  14.446453
min    21.000000  24.000000  23.000000
25%    23.000000  45.000000  43.000000
50%    34.000000  67.000000  56.000000
75%    45.000000  67.000000  56.000000
max    67.000000  88.000000  56.000000

# Finding sums for columns and rows separately

In [64]:
data=np.random.random(20).reshape(5,4)
df=pd.DataFrame(data,columns=["A","B","C","D"],index=["a","b","c","d","e"])
df

          A         B         C         D
a  0.445014  0.882364  0.690282  0.915367
b  0.836261  0.736623  0.442151  0.571983
c  0.616252  0.851338  0.963719  0.419068
d  0.203563  0.517685  0.224170  0.694412
e  0.909181  0.161483  0.846271  0.920147

In [65]:
df.sum()

A    3.010272
B    3.149494
C    3.166594
D    3.520977
dtype: float64

In [66]:
df.sum(axis=1)

a    2.933026
b    2.587019
c    2.850378
d    1.639831
e    2.837082
dtype: float64

In [67]:
df.mean()

A    0.602054
B    0.629899
C    0.633319
D    0.704195
dtype: float64

In [68]:
df.mean(axis=1)

a    0.733257
b    0.646755
c    0.712595
d    0.409958
e    0.709270
dtype: float64

In [69]:
df.median()

A    0.616252
B    0.736623
C    0.690282
D    0.694412
dtype: float64

In [70]:
df.median(axis=1)

a    0.786323
b    0.654303
c    0.733795
d    0.370928
e    0.877726
dtype: float64

In [71]:
df.var()

A    0.083209
B    0.089042
C    0.090426
D    0.047525
dtype: float64

In [72]:
df.var(axis=1)

a    0.046776
b    0.030481
c    0.059251
d    0.056545
e    0.134424
dtype: float64

In [73]:
df.std()

A    0.288460
B    0.298400
C    0.300710
D    0.218003
dtype: float64

In [74]:
df.std(axis=1)

a    0.216277
b    0.174588
c    0.243415
d    0.237792
e    0.366639
dtype: float64

In [75]:
df.min()

A    0.203563
B    0.161483
C    0.224170
D    0.419068
dtype: float64

In [76]:
df.max()

A    0.909181
B    0.882364
C    0.963719
D    0.920147
dtype: float64

# Dropping rows & columns

In [98]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

# Dropping rows

In [80]:
df.drop("b")

  Name  Age Result
a    A   23   Pass
c    C   21   Pass

In [95]:
df1=df.drop("b") # you can assign to the resultant df to a variable but original will not be affected
df1

  Name  Age Result
a    A   23   Pass
c    C   21   Pass

In [83]:
df  #see original data frame is not affected here

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [99]:
df.drop("b",inplace=True) # providing "inplace=True" Original dataframe will be changed/affected
df

  Name  Age Result
a    A   23   Pass
c    C   21   Pass

In [104]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]})
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass

In [105]:
df.drop(0,inplace=True) # Original dataframe is dropped oth row
df

  Name  Age Result
1    B   33   Fail
2    C   21   Pass

# Dropping columns

In [106]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [107]:
df.drop("Age",axis=1)

  Name Result
a    A   Pass
b    B   Fail
c    C   Pass

In [94]:
df # no change for original dataframe

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [108]:
df.drop("Age",axis=1)
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

# Sorting data frames with column values

In [109]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [122]:
df.sort_values(by="Mark3")

   Name  Mark1  Mark2  Mark3
2  Kane     44     67     76
0   Sam     67     56     78
1  Jane     54     56     89

In [114]:
df.sort_values(by="Mark3",inplace=True)
df

   Name  Mark1  Mark2  Mark3
2  Kane     44     67     76
0   Sam     67     56     78
1  Jane     54     56     89

In [131]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [133]:
df.sort_values(by="Mark3",ascending=True) # does not work???
df

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

# Grouping data frames with categorical data

In [134]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [136]:
list(df.groupby("Gender"))

[('F',
       ID  Age Gender  Marks
  0  1001   23      F     67
  1  1002   33      F     69
  3  1004   24      F     74),
 ('M',
       ID  Age Gender  Marks
  2  1003   34      M     76
  4  1005   25      M     90)]

In [138]:
GL1=list(df.groupby("Gender"))
GL1

[('F',
       ID  Age Gender  Marks
  0  1001   23      F     67
  1  1002   33      F     69
  3  1004   24      F     74),
 ('M',
       ID  Age Gender  Marks
  2  1003   34      M     76
  4  1005   25      M     90)]

In [139]:
GL1[0][1]

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
3  1004   24      F     74

In [140]:
GL1[1][1]

     ID  Age Gender  Marks
2  1003   34      M     76
4  1005   25      M     90

In [141]:
df.groupby("Gender").get_group("M")

     ID  Age Gender  Marks
2  1003   34      M     76
4  1005   25      M     90

In [142]:
df.groupby("Gender").get_group("F")

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
3  1004   24      F     74

# Summaries for other variables with grouping

In [146]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [147]:
df.drop("ID",axis=1,inplace=True)
df

   Age Gender  Marks
0   23      F     67
1   33      F     69
2   34      M     76
3   24      F     74
4   25      M     90

In [148]:
df.groupby("Gender").mean()

              Age  Marks
Gender
F       26.666667   70.0
M       29.500000   83.0

In [161]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [164]:
df.groupby("Gender").max() # Maximum values for Female given for attribute Age and Marks, Similarly Max age for Male and Marks

          ID  Age  Marks
Gender
F       1004   33     74
M       1005   34     90

In [162]:
df.groupby("Gender").mean()

                 ID        Age  Marks
Gender
F       1002.333333  26.666667   70.0
M       1004.000000  29.500000   83.0

In [149]:
df.groupby("Gender").sum()

        Age  Marks
Gender
F        80    210
M        59    166

In [150]:
df.groupby("Gender")["Age"].mean()

Gender
F    26.666667
M    29.500000
Name: Age, dtype: float64

In [151]:
df.groupby("Gender")["Marks"].mean()

Gender
F    70.0
M    83.0
Name: Marks, dtype: float64

# Summarizing other variables with grouping by using multiple options

In [160]:
df.groupby("Gender").agg(["mean","median","sum","min","max"])

              Age                    Marks
             mean median sum min max  mean median  sum min max
Gender
F       26.666667   24.0  80  23  33  70.0   69.0  210  67  74
M       29.500000   29.5  59  25  34  83.0   83.0  166  76  90

In [ ]:
df.groupby("Gender").agg(["mean","median","sum","min","max"])

In [159]:
df.groupby("Gender")["Age"].agg(["mean","median","sum","min","max"])

             mean  median  sum  min  max
Gender
F       26.666667    24.0   80   23   33
M       29.500000    29.5   59   25   34

# Concatenating data frames

In [3]:
import numpy as np
import pandas as pd
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df3=pd.DataFrame(np.random.random((5,2)),columns=["C","D"])

In [4]:
df1

          A         B
0  0.504800  0.045533
1  0.656487  0.838436
2  0.465752  0.004900
3  0.930252  0.324457
4  0.230153  0.190841

In [5]:
df2

          A         B
0  0.092924  0.944228
1  0.016913  0.654111
2  0.498336  0.573076
3  0.502417  0.730947
4  0.557397  0.369538

In [6]:
df3

          C         D
0  0.142953  0.724456
1  0.803892  0.092044
2  0.475558  0.977462
3  0.989709  0.681764
4  0.332090  0.962641

In [11]:
pd.concat([df1,df2]) #combine as rows

          A         B
0  0.504800  0.045533
1  0.656487  0.838436
2  0.465752  0.004900
3  0.930252  0.324457
4  0.230153  0.190841
0  0.092924  0.944228
1  0.016913  0.654111
2  0.498336  0.573076
3  0.502417  0.730947
4  0.557397  0.369538

# Concatenating along the rows

In [18]:
dfc1=pd.concat([df1,df2],ignore_index=True) #combine as rows without index from each
dfc1

          A         B
0  0.504800  0.045533
1  0.656487  0.838436
2  0.465752  0.004900
3  0.930252  0.324457
4  0.230153  0.190841
5  0.092924  0.944228
6  0.016913  0.654111
7  0.498336  0.573076
8  0.502417  0.730947
9  0.557397  0.369538

# Concatenating along the columns

In [17]:
dfc2=pd.concat([df1,df2],axis=1)#combine as columns
dfc2

          A         B         A         B
0  0.504800  0.045533  0.092924  0.944228
1  0.656487  0.838436  0.016913  0.654111
2  0.465752  0.004900  0.498336  0.573076
3  0.930252  0.324457  0.502417  0.730947
4  0.230153  0.190841  0.557397  0.369538

# Counting values

In [19]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [21]:
df["Col1"].value_counts()

Col1
P    2
Q    1
Name: count, dtype: int64

In [24]:
pd.value_counts(df["Col1"]) # another syntax to retrive same data

Col1
P    2
Q    1
Name: count, dtype: int64

In [25]:
pd.value_counts(df["Col2"])

Col2
X    1
Y    1
Z    1
Name: count, dtype: int64

# Working with indexes & columns

In [27]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

# Columns of the data frame

In [29]:
list(df.columns)

['Name', 'Marks', 'Class']

# Indexes of the data frame

In [30]:
list(df.index)

['a', 'b', 'c']

# Changing the order of the rows

In [36]:
df=pd.read_csv("iris.csv")
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [32]:
df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [33]:
print(list(df.index))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]

# Changing the order of the columns

In [37]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [42]:
df.reindex(['c','b','a'])

   Name  Marks  Class
c  Jane     78      3
b   Pam     32      2
a   Sam     56      1

In [43]:
df.reindex(columns=['Name','Class','Marks'])

   Name  Class  Marks
a   Sam      1     56
b   Pam      2     32
c  Jane      3     78

In [44]:
df.reindex(index=["a","b","c"],columns=['Name','Class','Marks'])

   Name  Class  Marks
a   Sam      1     56
b   Pam      2     32
c  Jane      3     78

# Renaming the indexes & columns

In [45]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [51]:
df.rename(index={"a":"p","c":"g"}) # Changing row headers

   Name  Marks  Class
p   Sam     56      1
b   Pam     32      2
g  Jane     78      3

In [50]:
df.rename(index={"a":"p","c":"g"},columns={"Name":"St Name","Class":"Class NO","Marks":"St Marks"}) #changing both row and column headers

  St Name  St Marks  Class NO
p     Sam        56         1
b     Pam        32         2
g    Jane        78         3

# Making indexes as a column

In [72]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [68]:
df.reset_index(inplace=True)
df

   index  Class  Marks
0      0      1     56
1      1      2     32
2      2      3     78

# Making a column as the index set

In [77]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [78]:
df.set_index("Name",inplace=True) # using Name column as index<---This is commponly used
df

      Marks  Class
Name
Sam      56      1
Pam      32      2
Jane     78      3

In [85]:
df.set_index("Class",inplace=True) # using class as an index
df

       level_0  index  Marks
Class
1            0      0     56
2            1      1     32
3            2      2     78

In [86]:
df.reset_index(inplace=True) # again reset indexes and see
df

   Class  level_0  index  Marks
0      1        0      0     56
1      2        1      1     32
2      3        2      2     78

# Random sample

How to get a random sample from a data set

In [87]:
d={"Name":["Sam","Pam","Jane","Kane","John"],"Marks":[56,32,78,79,87],"Class":[1,2,3,2,1]}
df=pd.DataFrame(d)
df

   Name  Marks  Class
0   Sam     56      1
1   Pam     32      2
2  Jane     78      3
3  Kane     79      2
4  John     87      1

In [95]:
df.sample(3) # every time you run this , you would get a random 3 samples from the given data set

   Name  Marks  Class
4  John     87      1
1   Pam     32      2
0   Sam     56      1

In [96]:
df.sample(3) # every time you run this , you would get a random 3 samples from the given data set

   Name  Marks  Class
3  Kane     79      2
2  Jane     78      3
1   Pam     32      2